Revit 2026 API

# AnalyticalElementGetCurve Method

---

Returns the curve of the Analytical Element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve GetCurve()
```
```vb
Public Function GetCurve As Curve
```
```cpp
public:
Curve^ GetCurve()
```
```fsharp
member GetCurve : unit -> Curve
```

#### Return Value

Curve The curve of the Analytical Element.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | This AnalyticalElement contains more than one single curve. |

If the Analytical Element cannot be expressed as a single curve, an exception is thrown.

#### Reference

AnalyticalElement Class

Autodesk.Revit.DB.Structure Namespace